var tconfig={
    "zhonggong":[1,7],//[1,7] or [1,1]
    "yuanstyle":"average",// average or classic
    "apptitle":"\u262F奇门遁甲",
}
var t={
    "":"",
    "gan":
        "甲 乙 丙 丁 戊 己 庚 辛 壬 癸".split(" "),
    "zhi":
        "子 丑 寅 卯 辰 巳 午 未 申 酉 戌 亥".split(" "),
    "jieqibyyinyang":
        "冬至 小寒 大寒 立春 雨水 惊蛰 春分 清明 谷雨 立夏 小满 芒种 夏至 小暑 大暑 立秋 处暑 白露 秋分 寒露 霜降 立冬 小雪 大雪".split(" "),
    "jieqibyyear":
        "小寒 大寒 立春 雨水 惊蛰 春分 清明 谷雨 立夏 小满 芒种 夏至 小暑 大暑 立秋 处暑 白露 秋分 寒露 霜降 立冬 小雪 大雪 冬至".split(" "),
    "liusan":
        "戊 己 庚 辛 壬 癸 丁 丙 乙".split(" "),
    "xunshou":
        "子 戌 申 午 辰 寅".split(" "),
    "zhibyjieqi":
        "丑 寅 卯 辰 巳 午 未 申 酉 戌 亥 子".split(" "),
    "baguabyyinyang":
        "坎 艮 震 巽 离 坤 兑 乾".split(" "),
    "baguabyhoutian":
        "坎 坤 震 巽 乾 兑 艮 离".split(" "),
    "baguabyG":
        "坎 坤 震 巽 中 乾 兑 艮 离".split(" "),
    "xingbyG":
        "蓬 芮 冲 辅 禽 心 柱 任 英".split(" "),
    "menbyG":
        "休 死 伤 杜 死 开 惊 生 景".split(" "),
    "zhibyG":
        "子 未申 卯 辰巳 _ 戌亥 酉 丑寅 午".split(" "),
    "menbyB":
        "休 生 伤 杜 景 死 惊 开".split(" "),
    "xingbyB":
        "辅 英 芮 柱 心 蓬 任 冲".split(" "),
    "shbyB":
        "值符 腾蛇 太阴 六合 白虎 玄武 九地 九天".split(" "),
    "shenbyB":
        "符 蛇 阴 合 虎 武 地 天".split(" "),
    "xunkong":
        "戌亥 申酉 午未 辰巳 寅卯 子丑".split(" "),
    "five":
        "木 火 土 金 水".split(" "),
    "zhibyS":
        "亥 午 寅 酉 寅 酉 巳 子 申 卯".split(" "),
    "sws":
        "长生 沐浴 冠带 临官 帝旺 衰 病 死 墓 绝 胎 养".split(" "),
    "no":
        "零一二三四五六七八九",
    "termyearlen":
        365.24219878,
    "terminfo":
        [0,1272494.4, 2548020.6, 3830143.8, 5120226.6, 6420865.8, 7732018.8, 9055272.6, 10388958, 11733065.4, 13084292.4, 14441592, 15800560.8, 17159347.2, 18513766.2, 19862002.2, 21201005.4, 22529659.8, 23846845.2, 25152606, 26447687.4, 27733451.4, 29011921.2, 30285477.6],
    "ordplate":
        [3,8,1,6,5,0,7,2],
    "ordreal":
        [3,8,1,2,4,6,7,0,5],
    "ordreal2":
        [7,0,5,2,4,6,3,8,1],
}
var rules=[
//十干克应"},
{tgan:"戊",dgan:"戊",title:"伏吟",note:"甲甲比肩，名谓伏吟。遇此，凡事不利，道路闭塞 ，以守为好"},
{tgan:"戊",dgan:"乙",title:"青龙和会",note:"甲乙会合，因甲乙均位于东方青龙之位，所以叫青龙和会，门吉事也吉，门凶事也凶"},
{tgan:"戊",dgan:"丙",title:"青龙返首",note:"因青龙甲木生助丙火，故为青龙返首，为事所谋，大吉大利，若逢迫墓击刑，吉事成凶"},
{tgan:"戊",dgan:"丁",title:"青龙耀明",note:"因甲木青龙生助丁火，故为青龙耀明，宜见上级领导、贵人、求功名，为事吉利。若值墓迫，招惹是非"},
{tgan:"戊",dgan:"己",title:"贵人入狱",note:"因为戌为戊土之墓，故为贵人入狱，公私皆不利"},
{tgan:"戊",dgan:"庚",title:"值符飞宫|飞宫格",note:"甲最怕庚金克杀，故为值符飞宫，吉事不吉，凶事更凶，求财没利益，测病也主凶。同时，甲庚相冲，飞宫也主换地方<br />此时作战主战阵败亡，大将遭擒，利静而不可躁进，不利为客，用兵先动者必败，以固守为吉。经商必破财，须改换经营地点。总之，凡占得飞宫格，百事皆凶，宜静不宜动，只要有动，必招灾咎。"},
{tgan:"戊",dgan:"辛",title:"青龙折足",note:"甲最怕庚金克杀，故为值符飞宫，吉事不吉，凶事更凶，求财没利益，测病也主凶。同时，甲庚相冲，飞宫也主换地方"},
{tgan:"戊",dgan:"壬",title:"青龙入天牢",note:"因壬为天牢，甲为青龙，故为青龙入天牢，凡阴阳事皆不吉利"},
{tgan:"戊",dgan:"癸",title:"青龙华盖|仪合",note:"因甲为青龙，癸为天网，又为华盖，故为青龙华盖，又戊癸相合，故逢吉门为吉，可招福临门。逢凶门者事多不利，为凶"},
{tgan:"乙",dgan:"戊",title:"阴害阳门",note:"乙木克戊土，为阴害阳门（因戊为阳为天门），利于阴人、阴事、不利阳人、阳事，门吉尚可谋为，门凶、门迫则破财伤人"},
{tgan:"乙",dgan:"乙",title:"伏吟",note:"乙乙比肩，为日奇伏吟，不宜见上层领导、贵人，不宜求名求利，只宜安分守己为吉"},
{tgan:"乙",dgan:"丙",title:"奇仪顺遂",note:"吉星迁官晋职，凶星夫妻反目离别"},
{tgan:"乙",dgan:"丁",title:"奇仪相佐",note:"最利文书、考试，百事可为"},
{tgan:"乙",dgan:"己",title:"日奇入墓",note:"因戌为乙木之墓，故为日奇入墓，被土暗昧，门凶事必凶，得生、开二吉门为地遁"},
{tgan:"乙",dgan:"庚",title:"日奇被刑|木入金乡|奇合",note:"庚金克刑乙木，故为日奇被刑，为争讼财产，夫妻怀有私意"},
{tgan:"乙",dgan:"辛",title:"青龙逃走|木入金乡",note:"乙为青龙，辛为白虎，乙木被辛金冲克而逃，故为青龙逃走，人亡财破，奴仆拐带，六畜皆伤。测婚为女逃男<br />因为乙木为青龙，辛金为白虎，辛金克乙木，因乙木弃而逃去，故名青龙逃走。此时不宜举兵，主将士逃窜，临阵败亡，所谋百事皆凶，财利倾覆，身遭残毁。总之，青龙逃走是一个大凶之格，通常代表君子主动离开恶劣环境、人才流失、人才出走、君子遭遇困境、险境而主动逃离等"},
{tgan:"乙",dgan:"壬",title:"日奇入地",note:"尊卑悖乱，官讼是非，有人谋害之事"},
{tgan:"乙",dgan:"癸",title:"华盖逢星",note:"遁迹修道，隐匿藏形，躲灾避难为吉"},
{tgan:"丙",dgan:"戊",title:"飞鸟归巢",note:"甲为丙火之母，丙火回到终亲身边，好似飞鸟归巢，故名鸟跌穴，百事吉，事业可为，可谋大事"},
{tgan:"丙",dgan:"乙",title:"日月并行",note:"公谋私皆为吉"},
{tgan:"丙",dgan:"丙",title:"月奇悖师",note:"文书逼迫，破耗遗失。主单据票证不明遗失"},
{tgan:"丙",dgan:"丁",title:"星奇朱雀",note:"贵人文书吉利，常人平静安乐，得三吉门为天遁"},
{tgan:"丙",dgan:"己",title:"火悖入刑",note:"因丙火入戌墓，故为火悖入刑，因人刑杖，文书不行，吉门得吉，凶门转凶。天盘丙加地盘甲申庚，即丙加庚，为荧入太白门户破败，盗贼耗失，事业亦凶"},
{tgan:"丙",dgan:"庚",title:"荧入太白",note:"门户破败，盗贼耗失，事业亦凶<br />丙火为荧惑火星，庚金为太白金星，今丙火加临地盘庚金之上来行克制，天盘动而地盘静，故庚金是被动受克制的，庚金为贼，故有火入金乡贼即去之应。凡征战得此格，须乘胜追击，敌兵退藏受损，有不战自败、束手就擒之应"},
{tgan:"丙",dgan:"辛",title:"丙辛相合|奇合",note:"因丙辛相合，故为谋事能成，为疾病人不凶"},
{tgan:"丙",dgan:"壬",title:"火入天罗",note:"壬水冲克丙火，故为客不利，是非颇多"},
{tgan:"丙",dgan:"癸",title:"华盖悖师",note:"阴人害事，灾祸频生"},
{tgan:"丁",dgan:"戊",title:"青龙转光",note:"官人升迁，常人威昌"},
{tgan:"丁",dgan:"乙",title:"人遁",note:"贵人加官晋爵，常人婚姻财帛有喜"},
{tgan:"丁",dgan:"丙",title:"星随月转",note:"贵人越级高升，常人乐极生悲，要忍，不然因小的不忍而引起大的不幸"},
{tgan:"丁",dgan:"丁",title:"星奇入阴",note:"文书证件即至，喜事从心，万事如意"},
{tgan:"丁",dgan:"己",title:"火入勾陈",note:"因戌为火库，己为勾陈，故为火入勾陈，奸私仇冤，事因女人"},
{tgan:"丁",dgan:"庚",title:"文书阻隔",note:"丁为文书，庚为阻隔之神，故为文书阻隔，行人必归"},
{tgan:"丁",dgan:"辛",title:"朱雀入狱",note:"罪人释囚，官人失位"},
{tgan:"丁",dgan:"壬",title:"丁壬相合|奇合",note:"主贵人恩诏，讼狱公平。测婚多为苟合"},
{tgan:"丁",dgan:"癸",title:"朱雀投江",note:"癸水冲克丁火，为朱雀投江，文书口舌是非，经官动储，词讼不利，音信沉溺不到<br />丁为火，为朱雀，癸为水，为江河，丁加癸上，受癸水之克，象征朱雀落入江河之中，故名朱雀投江。古时朱雀是用来传递情报、信息的重要工具。因此朱雀投江代表音信沉溺、石沉大海、杳无音信之类的信息。凡占得此格，则不宜上官、入市、嫁娶、迁移、远行等。现在可用来代表空难、飞机失事等信息。总之，朱雀投江主百事不利，尤不利考学、考试"},
{tgan:"己",dgan:"戊",title:"犬遇青龙",note:"因戌为犬，甲为龙，故为犬遇青龙，门吉为谋望遂意，上人见喜；若门凶，枉费心机"},
{tgan:"己",dgan:"乙",title:"地户逢星",note:"因戌为乙木之墓，己又为地户，故墓神不明，地户逢星，宜遁迹隐形为利"},
{tgan:"己",dgan:"丙",title:"火悖地户",note:"因火悖地户，男人冤冤相报，女人必致淫污"},
{tgan:"己",dgan:"丁",title:"朱雀入墓",note:"因戌为火墓，故名为朱雀入墓，文书词讼，先曲后直"},
{tgan:"己",dgan:"己",title:"地户逢鬼",note:"病者发凶或必死，百事不遂，暂不谋为，谋为则凶"},
{tgan:"己",dgan:"庚",title:"刑格返名",note:"词讼先动者不利，如临阴星则有谋害之情"},
{tgan:"己",dgan:"辛",title:"游魂入墓",note:"易遭阴邪鬼魅作崇"},
{tgan:"己",dgan:"壬",title:"地网高张",note:"狡童佚女，奸情伤杀，凶"},
{tgan:"己",dgan:"癸",title:"地刑玄武",note:"男女疾病垂危，有囚狱词讼之灾"},
{tgan:"庚",dgan:"戊",title:"天乙伏宫|伏宫格",note:"庚金克甲木，谓天乙伏宫，百事不可谋，大凶；所谓伏宫格，是因天盘有庚金加临在值符之上，因值符为甲，甲之头上有庚金加临，庚金克甲木，固然是甲木动弹不得，只能趴伏在地。凡占得此格均为大凶。主客皆不利，求人不在，等人不来。出行则路遇盗贼、车折马死，百事不顺。"},
{tgan:"庚",dgan:"乙",title:"太白逢星|合格",note:"退吉进凶，谋为不利"},
{tgan:"庚",dgan:"丙",title:"太白入荧|贼格",note:"测贼盗时，看贼人来不来，太白入荧，贼定要来，为客进利，为主破财<br />庚为太白金星，丙为荧惑火星，庚为白虎为阳金，丙为阳火，按理庚金最怕丙火之克，今明知地盘有丙火，庚金仍然加临其上，足以说明庚金之强大、威猛。故有太白入荧者，占贼贼必来，须防贼来偷营，固守为吉，切莫主动出兵"},
{tgan:"庚",dgan:"丁",title:"亭亭之格|破格",note:"因私匿或男女关系起官司是非，门吉有救，门凶事必凶"},
{tgan:"庚",dgan:"己",title:"官符刑格|刑格",note:"主有官司口舌，因官讼被判刑，住牢狱更凶<br />此时行兵大凶，战阵主丧，出行中途阻隔，诸事不利。又主官司受刑、经商破财、出行患病。总之占事遇刑格，多有不利"},
{tgan:"庚",dgan:"庚",title:"太白同宫|战格",note:"官灾横祸，兄弟或同辈朋友相冲撞，不利为"},
{tgan:"庚",dgan:"辛",title:"白虎干格",note:"不宜远行，远行车折马伤，求财更为大凶"},
{tgan:"庚",dgan:"壬",title:"上格",note:"壬水主流动，庚为阻隔之神，故远行道路迷失，男女音信难通；。<br />又小格、移荡格，远行迷失道路，求谋破财得病。凡占事遇小格，多主变动、迁移。"},
{tgan:"庚",dgan:"癸",title:"大格",note:"因寅申相冲克，庚为道路，故多主车祸，行人不至，官事不止，生育母子俱伤，大凶<br />此格谋事做事百事不利，出外主车破马伤，阻隔不前，只利于捕盗，很快即能捕获犯人。何名大格？格者，格斗也。庚为白虎金神，为甲申庚，癸为甲寅癸，今庚加癸即是申寅对峙相冲，甲、寅为青龙，庚、申为白虎，一场恶战难免，故曰大格，即一场较大的战争、格斗。凡占测遇大格，必有大的纷争、打斗等"},
{tgan:"辛",dgan:"戊",title:"困龙被伤",note:"主官司破财，屈抑守分尚可，妄动则带来祸殃"},
{tgan:"辛",dgan:"乙",title:"白虎猖狂",note:"辛金冲克乙木，故名为白虎猖狂，家败人亡，远行多灾殃测婚离散，主因男人<br />因辛金为白虎，且在天盘，故其是动态的。乙奇在地盘为静态，只好默默地忍受天盘辛金的无情克制。此时举事主客两伤，出入有惊恐，远行多有灾咎，此时不宜行兵，谋财虚耗，小人是非，最忌行船、婚姻、修造，大凶。凡占得白虎猖狂凶格，主人才不得重用，君子囹圄于小人之手，正义不能得以伸张，邪恶势力压制正气力量"},
{tgan:"辛",dgan:"丙",title:"干合悖师",note:"门吉则事吉，门凶则事凶，测事易因财物致讼"},
{tgan:"辛",dgan:"丁",title:"狱神得奇",note:"辛为狱神，丁为星奇，故名为狱神得奇，经商求财获利倍增，囚人逢天赦释免"},
{tgan:"辛",dgan:"己",title:"入狱自刑",note:"辛为罪人，戌为午火之库，故名为入狱自刑，奴仆背主，有苦诉讼难伸"},
{tgan:"辛",dgan:"庚",title:"白虎出力",note:"刀刃相交，主客相残，逊让退步稍可，强进血溅衣衫"},
{tgan:"辛",dgan:"辛",title:"伏吟天庭",note:"因午午为自刑，故名为伏吟天庭，公废私就，讼狱自罹罪名"},
{tgan:"辛",dgan:"壬",title:"凶蛇入狱",note:"因壬为凶蛇，辛为牢狱，故名为凶蛇入狱，两男争女，讼狱不息，先动失理"},
{tgan:"辛",dgan:"癸",title:"天牢华盖",note:"因辛为天牢，癸为华盖，故名为天牢华盖，日月失明，误入天网，动止乖张"},
{tgan:"壬",dgan:"戊",title:"小蛇化龙",note:"因壬为小蛇，甲为青龙，故为小蛇化龙，男人发达，女人产婴童"},
{tgan:"壬",dgan:"乙",title:"小蛇得势",note:"女人柔顺，男人通旺，测孕育生子禄马光华"},
{tgan:"壬",dgan:"丙",title:"水蛇入火",note:"因壬丙相冲克，故主官灾刑禁，络绎不绝"},
{tgan:"壬",dgan:"丁",title:"干合蛇刑",note:"因丁壬相合，故名为干合蛇刑，文语书牵连，贵人匆匆，男吉女凶"},
{tgan:"壬",dgan:"己",title:"反吟蛇刑",note:"因辰戌相冲，故名为反吟蛇刑，主官讼败诉，大祸将至，顺守可吉，妄动必凶"},
{tgan:"壬",dgan:"庚",title:"太白擒蛇",note:"因庚为太白，壬为蛇，故名为太白擒蛇，刑狱公平，立剖邪正"},
{tgan:"壬",dgan:"辛",title:"腾蛇相缠",note:"因辛金入辰水之墓，故名为腾蛇相缠，纵得吉门，亦不能安宁，若有谋望，被人欺瞒"},
{tgan:"壬",dgan:"壬",title:"蛇入地罗",note:"外人缠绕，内事索索，吉门吉星，庶免蹉跎"},
{tgan:"壬",dgan:"癸",title:"幼女奸淫",note:"主有家丑外扬之事发生，门吉星凶，易反福为祸"},
{tgan:"癸",dgan:"戊",title:"天乙会合",note:"戊癸相合，名为天乙人合，吉门宜求财，婚姻喜美，吉人赞助成合。若门凶迫制，反祸官非"},
{tgan:"癸",dgan:"乙",title:"华盖逢星",note:"贵人禄位，常人平安。门吉则吉，门凶则凶"},
{tgan:"癸",dgan:"丙",title:"华盖悖师",note:"贵贱逢之皆不利，唯上人见喜"},
{tgan:"癸",dgan:"丁",title:"腾蛇夭矫",note:"因癸水冲克丁火，丁火烧灼癸水，故名为螣蛇夭矫，文书官司，火焚也逃不掉<br />癸为北方玄武、龟蛇，丁为火，癸加丁犹如螣蛇跌入火中被烧而屈伸不已，故曰螣蛇夭矫。该格主动作虚惊、盗贼水火、文书迟滞等。兵家遇此格，须防敌方使用妖术、火攻。占病得此格，心脏必有疾患"},
{tgan:"癸",dgan:"己",title:"华盖地户",note:"男女测之，音信皆阻，此格躲灾避难方为吉"},
{tgan:"癸",dgan:"庚",title:"太白入网",note:"主以暴力争讼，自罹罪责"},
{tgan:"癸",dgan:"辛",title:"网盖天牢",note:"主官司败诉，死罪难逃；测病亦大凶"},
{tgan:"癸",dgan:"壬",title:"复见腾蛇",note:"因癸、壬均为水蛇，故名为复见螣蛇，主嫁娶重婚，后嫁无子，不保年华"},
{tgan:"癸",dgan:"癸",title:"天网四张",note:"主行人失伴，病讼皆伤<br />天网四张落一、二、三、四宫为网低，落六、七、八、九宫为网高。古云：天网四张，万物尽伤，百事不宜，只宜逃亡。"},
//八门克应
//吉格
{title:"三奇贵人升殿",tgan:"丁",gua:"兑",note:"为日出扶桑，有禄之乡，是贵人升于乙卯正殿"},
{title:"三奇贵人升殿",tgan:"丙",gua:"离",note:"为月照端门，火旺之地，是贵人繁荣昌盛于丙午正殿"},
{title:"三奇贵人升殿",tgan:"乙",gua:"震",note:"为星见西方，（酉为丁火长生之地）天之神位，是贵人升于丁酉正殿"},
{title:"三奇之灵",tgan:"乙/丙/丁",men:"开/休/生",shen:"阴/合/地/天",note:"其临其方位，为吉道清灵，用事俱吉"},
{title:"奇游禄位",tgan:"乙",gua:"震",note:"卯为乙木临官禄地，为本禄之位，合三吉门，宜上官卦任，求财祈福等各种谋为都吉利"},
{title:"奇游禄位",tgan:"丙",gua:"巽",note:"巳为丙临官禄地，为本禄之位，合三吉门，宜上官卦任，求财祈福等各种谋为都吉利"},
{title:"奇游禄位",tgan:"丁",gua:"离",note:"午为丁火临官禄地，为本禄之位，合三吉门，宜上官卦任，求财祈福等各种谋为都吉利"},
{title:"天遁",tgan:"丙",men:"生",dgan:"丁",note:"二奇并生门，二火生艮土（生门属土，位于艮宫），故为吉格。百事生旺，利行军、打仗、上书、求官、经商、婚姻等"},
{title:"地遁",tgan:"乙",men:"开",dgan:"己",note:"己为地户，开门又得日精之蔽，故百事皆吉。宜安营扎寨、埋伏截击、建筑修造等"},
{title:"人遁",tgan:"丁",men:"休",shen:"阴",note:"此遁得星精之蔽，其方可以探索、伏藏、和谈、求贤、结婚、交易等，均为吉"},
{title:"风遁",tgan:"乙",men:"开/休/生",gua:"巽",note:"巽木主风，又得乙奇和吉门，故为风遁。如风从西北方来，宜顺风击敌；如风从东南方来，敌在东南方，不可交战"},
{title:"云遁",tgan:"乙",men:"开/休/生",dgan:"辛",note:"此遁得云精之蔽，宜求雨、立营寨、造军械"},
{title:"龙遁",tgan:"乙",men:"开/休/生",gua:"坎",note:"宜掩捕敌人、水战、修桥、穿井等"},
{title:"龙遁",tgan:"乙",men:"开/休/生",dgan:"癸",note:"宜掩捕敌人、水战、修桥、穿井等"},
{title:"虎遁",tgan:"乙",men:"休/生",dgan:"辛",gua:"艮",note:"宜安营扎寨，设隐埋伏、修筑建造等"},
{title:"虎遁",tgan:"庚",men:"开",gua:"兑",note:"宜安营扎寨，设隐埋伏、修筑建造等"},
{title:"神遁",tgan:"丙",men:"生",shen:"天",note:"宜攻虚、开路、塞河、造像、教化兵卒等"},
{title:"鬼遁",tgan:"丁",men:"杜/开",shen:"地",note:"宜偷营劫寨，设伪伏虚"},
{title:"三奇得使",tgan:"乙/丙/丁",men:"使",note:"《烟波钓叟歌》“三奇得使诚堪使，六甲遇之非小补，乙逢犬马丙鼠猴，六丁玉女奇龙虎。”对此，历代研究者解说不一。因为这其中有明显 的矛盾：乙逢犬马，即乙奇加甲戊己和甲午辛，乙+己为日奇入墓，乙+辛为龙逃走凶格：丙鼠猴，即丙奇加甲子戊和甲申庚，丙+戊为鸟跌穴吉格，但丙+庚为荧入白凶格；六丁玉女骑龙虎，即丁奇加甲辰壬和甲寅癸，丁+壬虽为吉格，但丁+癸为雀投江凶格。以上六格，除丙+戊、丁+壬为吉格外，其余四格均为凶格，怎么能叫“六甲遇之非小补”“诚堪使”的吉格呢？"},
{title:"欢怡",tgan:"乙/丙/丁",star:"符",note:"凡事谋为皆有利，抚恤将士，众情悦服"},
{title:"玉女守门",dgan:"丁",men:"使",note:"甲子旬的庚午时，甲戌旬的己卯时，甲申旬的戊子时，甲午旬的丁酉时，甲辰旬的丙午时，甲寅旬的乙卯时。玉女守门，其方利宴会喜乐之事、婚姻之事"},
{title:"真诈",tgan:"乙/丙/丁",men:"开/休/生",shen:"阴",note:"三吉门得三奇又得三阴神相助，百事皆吉。"},
{title:"重诈",tgan:"乙/丙/丁",men:"开/休/生",shen:"地",note:"三吉门得三奇又得三阴神相助，百事皆吉。"},
{title:"休诈",tgan:"乙/丙/丁",men:"开/休/生",shen:"合",note:"三吉门得三奇又得三阴神相助，百事皆吉。"},
{title:"天假",men:"景",tgan:"乙/丙/丁",shen:"天",note:"宜争战诉讼、见贵求官，上书献策，扬兵颁号，申明盟约"},
{title:"地假",men:"杜",tgan:"丁/己/癸",shen:"地/阴/合",note:"宜潜藏埋伏、逃亡躲灾、谋探私事"},
{title:"人假",men:"惊",tgan:"壬",shen:"天",note:"宜捕捉逃亡，如果再遇上“太白入荧”的格局，一定能抓获逃亡者"},
{title:"神假",men:"伤",tgan:"丁/己/癸",shen:"地/合",note:"宜于埋藏，祈祷、索债、捕捉、交易、伏藏"},
{title:"鬼假",men:"死",tgan:"丁/己/癸",shen:"地",note:"宜超度亡灵，扶重安民，破土修茔、伐邪、狩猎"},
//凶格尚未校对
//六仪击刑 天盘值符，加地盘与值符相刑的宫,star:"符"?
{title:"子刑卯",tgan:"戊",gua:"震",note:"六仪击刑极凶，即使六仪为值符，也不可用。一动必有灾伤，若遇天网四张格，必被捕捉，有牢狱之灾"},
{title:"戌刑未",tgan:"己",gua:"坤",note:"六仪击刑极凶，即使六仪为值符，也不可用。一动必有灾伤，若遇天网四张格，必被捕捉，有牢狱之灾"},
{title:"申刑寅",tgan:"庚",gua:"艮",note:"六仪击刑极凶，即使六仪为值符，也不可用。一动必有灾伤，若遇天网四张格，必被捕捉，有牢狱之灾"},
{title:"午自刑",tgan:"辛",gua:"离",note:"六仪击刑极凶，即使六仪为值符，也不可用。一动必有灾伤，若遇天网四张格，必被捕捉，有牢狱之灾"},
{title:"辰自刑",tgan:"壬",gua:"巽",note:"六仪击刑极凶，即使六仪为值符，也不可用。一动必有灾伤，若遇天网四张格，必被捕捉，有牢狱之灾"},
{title:"寅刑巳",tgan:"癸",gua:"巽",note:"六仪击刑极凶，即使六仪为值符，也不可用。一动必有灾伤，若遇天网四张格，必被捕捉，有牢狱之灾"},
//三奇入墓"},
{title:"三奇入墓",tgan:"乙",gua:"乾/坤",note:"乙木为阴木，长生于午，帝旺在寅，墓在戌（乾）；或乙属木，按木笼统讲，墓在未（坤）。百事不宜，谋事尽休。凡事吉的不吉，凶的不凶，无力之象"},
{title:"三奇入墓",tgan:"丙",gua:"乾",note:"戌为丙火之墓。百事不宜，谋事尽休。凡事吉的不吉，凶的不凶，无力之象"},
{title:"三奇入墓",tgan:"丁",gua:"艮",note:"丁为阴火，长生酉，帝旺在巳，墓在丑。百事不宜，谋事尽休。凡事吉的不吉，凶的不凶，无力之象"},
//三奇受刑"},
{title:"火入水乡",tgan:"丙/丁",gua:"坎",note:"三奇受刑，不可行动"},
{title:"火入水乡",tgan:"丙/丁",dgan:"壬/癸",note:"三奇受刑，不可行动"},
{title:"木入金乡",tgan:"乙",gua:"乾/兑",note:"三奇受刑，不可行动"},
//门迫"},
{title:"门迫",men:"惊/开",gua:"震/巽",note:"金克木，吉门被迫吉不就，凶门被迫祸重重"},
{title:"门迫",men:"休",gua:"离",note:"水克火，吉门被迫吉不就，凶门被迫祸重重"},
{title:"门迫",men:"生/死",gua:"坎",note:"土克水，吉门被迫吉不就，凶门被迫祸重重"},
{title:"门迫",men:"伤/杜",gua:"坤/艮",note:"木克土，吉门被迫吉不就，凶门被迫祸重重"},
{title:"门迫",men:"景",gua:"乾/兑",note:"火克金，吉门被迫吉不就，凶门被迫祸重重"},
//伏吟分为门，星，值符，最后的是十干克应里有

//反吟（门星）"},
{title:"反吟",men:"休",gua:"离",note:""},
{title:"反吟",men:"伤",gua:"兑",note:""},
{title:"反吟",men:"景",gua:"坎",note:""},
{title:"反吟",men:"惊",gua:"震",note:""},
{title:"反吟",star:"蓬",gua:"离",note:""},
{title:"反吟",star:"冲",gua:"兑",note:""},
{title:"反吟",star:"英",gua:"坎",note:""},
{title:"反吟",star:"柱",gua:"震",note:""},
//悖格"},
{title:"悖格",tgan:"丙",men:"使",note:"因为丙为天威，性格威猛，过于暴躁，容易出乱子，把事情搞乱。悖格之时举事，多倒行逆施，纲纪紊乱，难达理想，易出乱臣贼子和叛逆之人。但丙又为三奇之一，如得三吉门相会，则可用，不能一律按凶断。"},
{title:"悖格",star:"符",dgan:"丙",note:"因为丙为天威，性格威猛，过于暴躁，容易出乱子，把事情搞乱。悖格之时举事，多倒行逆施，纲纪紊乱，难达理想，易出乱臣贼子和叛逆之人。但丙又为三奇之一，如得三吉门相会，则可用，不能一律按凶断。"},
{title:"悖格",tgan:"丙",dgan:"年干/月干/日干/时干",note:"因为丙为天威，性格威猛，过于暴躁，容易出乱子，把事情搞乱。悖格之时举事，多倒行逆施，纲纪紊乱，难达理想，易出乱臣贼子和叛逆之人。但丙又为三奇之一，如得三吉门相会，则可用，不能一律按凶断。"},
{title:"飞干格",tgan:"日干",dgan:"庚",note:"与“伏干格”正好相反，因为日柱天干，在天用上转动，遇上地盘凶星庚金，故叫飞干格。也为大凶，主客两伤，皆不利<br />战斗主客皆伤，出行主有飞灾横祸。因日干代表求测者，奇门中庚为最凶，日干飞临其上必然大凶，故必须飞离庚金，因名飞干格。凡占得飞干格，多主遭遇不测、遇上灾厄、身陷困境等信息。总之，飞干格是大凶之格"},
{title:"岁格",tgan:"庚",dgan:"年干",note:"用事大凶，只宜捕捉盗贼或寻找走失之人<br />凡此时，行兵、远行、谋事、做事都不利，只宜捕捉盗贼逃犯"},
{title:"月格",tgan:"庚",dgan:"月干",note:"用事大凶，只宜捕捉盗贼或寻找走失之人<br />凡此时，行兵、远行、谋事、做事都不利，只宜捕捉盗贼逃犯"},
{title:"日格",tgan:"庚",dgan:"日干",note:"因日的天干伏在庚金之下，所以又叫“伏干格”。主客皆伤，尤不利主。奇门预测，多以日干为求测者本人，犹如“八字”中以日柱天干为命造本人一样，今遇凶星庚金，自然大凶不利，只宜捕捉盗贼或寻找走失之人<br />此时战必遭擒，主客两伤，出行尤其忌讳。日干为求测者，庚为最凶，今庚加临日干之上，故有日干（求测者）遭遇外来灾厄之象，亦有行动不得自由之象"},
{title:"时格",tgan:"庚",dgan:"时干",note:"主凶，只宜捕捉盗贼或寻找走失之人<br />凡此时，行兵、远行、谋事、做事都不利，只宜捕捉盗贼逃犯"},
//时干入暮
{title:"时干丙入墓",sizhu:"时干丙",gua:"乾",note:"时辰为凶，不可用事"},
{title:"时干丁入墓",sizhu:"时干丁",gua:"艮",note:"时辰为凶，不可用事"},
{title:"时干壬入墓",sizhu:"时干壬",gua:"巽",note:"时辰为凶，不可用事"},
{title:"时干癸入墓",sizhu:"时干癸",gua:"坤",note:"时辰为凶，不可用事"},
{title:"时干戊入墓",sizhu:"时干戊",gua:"乾",note:"时辰为凶，不可用事"},
{title:"时干己入墓",sizhu:"时干己",gua:"艮",note:"时辰为凶，不可用事"},
{title:"时干乙入墓",sizhu:"时干乙",gua:"乾",note:"时辰为凶，不可用事"},
{title:"时干庚入墓",sizhu:"时干庚",gua:"艮",note:"时辰为凶，不可用事"},
{title:"时干辛入墓",sizhu:"时干辛",gua:"巽",note:"时辰为凶，不可用事"},
{title:"时干甲入墓",sizhu:"时干甲",gua:"坤",note:"时辰为凶，不可用事"}, 
//单个元素
{gua:"乾",title:"乾",note:"乾为天，为太阳，为冰、雹等。<br />在国家，为国君，主席，总统：在单位为书记，一把手，主要领导人；<br />在家庭为父亲，为大人，为老人，为长辈人；在社会为名人、公门人，宦官；在性别为男，在年龄为老头；在场所为京都，为大城市，形胜之地，高亢之所；<br />在方位为西北方，为南方（为上方，为高处）；在时间为秋季，农历九、十月，戊亥年、月、日、时，立冬至大雪45天；在数字为一、六、四、九（五行金数）；<br />在动物为马、象、天鹅、狮子；<br />在静物为金玉、珠宝、圆物、木果、刚物、冠、镜；<br />在人体为头、右腿（九宫位）、肺、骨胳、男性生殖器官；<br />在颜色为白色、大赤色、玄色；在五味为辛、辣。<br />"},
{gua:"坤",title:"坤",note:"坤为地，表现地的功能、潜意识及柔顺的性质。在天时又为阴云、雾气、冰霜。<br />在国家为皇后、第一夫人：在单位为职工、群众；在家庭为母亲、祖母，为老母、后母、老妇人；在社会为众人、为乡人、为小人、为大腹人、为懦弱之人、吝啬之人；<br />在性别为女；在年龄为老妇，老年女人。<br />在场所为田野、为大地、为乡村、为平地。<br />在方位为西南方，北方（先天八卦方位），下方，底层。<br />在时间为农历六月、七月，未、申年、月、日、时，辰、戌、丑、未五行为土年，月、月、日，立秋至白露45天。<br />在数字为二（后天八卦数）、八（先天八卦数）、五、十（五行土数）。<br />在动物为牛、为牝马、为猫、为百兽。<br />在静物为水泥、砖瓦、五谷、布帛、丝绵、方物、柔物，土中之物，牛肉、食品、大车、锅。<br />在人体为腹，右肩（九宫位），脾、胃、肌肉，女性生殖器。<br />在颜色为黄色、黑色。<br />五味中为甘味、甜味。<br />"},
{gua:"震",title:"震",note:"震为雷，表示震动、奋起的性质和状态。在天象为雷雨、雷鸣、地震、火山喷发。<br />在国家和单位为当权的二把手；在家庭为长男；在社会为驾驶员、运动员、警察、法官、军人、飞行员、列车员、社会活动家、舞蹈演员、足球爱好者、狂人、壮士。<br />在场所为工厂、广播电台、乐器店、游乐场、机场、发射场、车站、舞厅、歌厅、闹市、战场、森林、草木茂盛之所。<br />在方位为东方，东北方（天八卦方位）。<br />在时间为农历春二月，春分至谷雨45天，卯年、月、日、时。<br />在数字为四（先天八卦数）、三（后天八卦数、五行木数）、八（五行木数）。<br />在动物为龙、蛇、善鸣这马，善鸣之鸟，百虫，鲤鱼。<br />在静物为木、竹、苇、乐器、蔬菜、鲜花、树木、电话、飞机、汽车、火箭、鞭炮、闹钟、花草繁鲜之物、蹄、肉、山林野味。<br />在人体为足，为肝胆，为左胁。在颜色为青、绿、碧色。<br />五味为酸<br />"},
{gua:"巽",title:"巽",note:"巽为风，表示自由活动和渗透性。天象代表刮风、台风、飓风、龙卷风等。<br />在家庭为长女、女儿；在社会为科技人员、教师、僧尼、仙道这人，气功师、练功者、商人、营业员、木材经营者、手艺人、能工巧匠、额头宽的人，头发细长而直的人，优柔寡断的人，自由职业者。<br />在场所为邮局、管道、线路、隘路、过道、长廊、寺观、草原、竹林、芦苇荡、升降机、传送带。<br />在方向为东南方，西南（先天八卦方位）。<br />在时间为春夏之交，农历三、四月，辰、巳年、月、日、时、立夏至芒种45天。<br />在数字为五（先天八卦数）、四（九宫数）、三、八（五行木数）。<br />在人体为股、肱、胆、气管、神经、左肩（九宫位）、练功之元气。<br />在动物为鸡、鸭、鹅、蝶、蜻蜒、蛇、蚯蚓、带鱼、鳗鱼、鳝鱼、斑马等。<br />静物为树木、木材、木制品、纤维品、丝线、绳子、麻、风扇、干燥机、飞机、气球、气垫船、帆船、蚊香、木香、兰花、草药、羽毛、枝叶、腰带、海带、下面有口的器物。<br />在颜色为绿色、蓝色。<br />五味为酸。<br />"},
{gua:"坎",title:"坎",note:"坎为水，为月亮，表示艰难、险阻的状态。在天象为雨、雷、露、霜。<br />在家庭为中男，中年男子；在社会为江湖之人、舟人、盗贼、匪徒，为数学、医生、律师、逃亡者、黑社会之人、诈骗犯、劳务人员、酒鬼、娼妇、自来水公司人员。<br />在场所为江河、湖、海、沟、渠、井、泉、下水道、洼地、酒店、冷饮店、浴室、澡堂、水族馆、地下室、暗室、自来水公司、鱼塘、饮食店、妓院。<br />在人体为肾脏、膀胱、泌尿系统、生殖系统、血液、内分泌系统、耳、肛门。<br />在动物为猪、为鼠、为狐狸、水鸟、鱼类、水中动物、美脊之马、劳苦之马、脊椎动物。<br />在静物为油、酒、醋、酱油、饮料、石油、药品、水车、轮子、刑具、蒺藜、丛刺、带核的果品、冷藏设备、浮萍、潜水艇。<br />在方位为北方，西方（先天八卦方位）。<br />在时间为农历十一月，子年、月、日、时，冬至至大寒45天。<br />在数字为一（九宫数）、六（五行水数，一、六水）。<br />在颜色为黑色，或白色（玄空飞星颜色一白）。<br />五味为咸味。<br />"},
{gua:"离",title:"离",note:"离为火，为目，表示光明、美丽的性质和状态。天象为晴天、热天、酷暑、烈日、干旱、虹霓、霞光。<br />在家庭为中女、中年妇女；在单位为中层干部；在社会为中间层次人物，为美人、美容师、文人、作家、艺术家、演员、名星、编辑、侦察员、纪检人员。<br />在场所为朝阳的场所、名胜古迹、圣地、教堂、华丽的街道、电影院、电视台、画院、美术馆、图书馆、印刷厂、广告塔、电车站、冶炼厂、放射室。<br />在方位为南方，东方（先天八卦方位）。<br />在时间为夏天，为农历五月，为午年、月、日、时，夏至至大暑45天。<br />在数字为三（先天八卦数）、九（九宫数）、二、七（五行火数）。<br />在人体为眼、头部、心脏、小肠。<br />在动物为野鸡、孔雀、凤凰、仙鹤，为虾、蟹、螺、贝类，为鳖、龟、“变色龙”，萤火虫。<br />在静物为字、画、美术品、报纸、刊物、图书、杂志、契约、文书、合同、书信、照相机、摄影机、录相机、电视机、复印机、照明用具、广告、奖状、电报、连环画、化妆品、火炉、打火机、火柴、烧烤物品、焊枪、霓虹灯。<br />在颜色为红色、赤色，花色，紫色（九紫）。<br />五味为苦味。<br />"},
{gua:"艮",title:"艮",note:"艮为山，为土，表示静止和安定的状态。天象为云，为雾，为岚。<br />在家庭为少男，表少年；在社会为少年、儿童，为土建人员、宗教人员、官僚、贵族、继承人、警卫、守门人、矿工、狱吏、石匠、储蓄所人员。<br />在场所为山、山地、丘陵、高台、堤坝、休息室、坟场、阁寺、房屋、监狱、公安机关、派出所、大楼、城墙、仓库、宗庙、祠堂、矿山、采石场、银行、贮藏室。<br />在方位为东北方，西北（先天八卦方位）。<br />在时间为冬春之交，农历十二月和正月，丑、寅年、月、日、时，立春至惊垫45天。<br />在数字为七（先天八卦数）、八（九宫数）、五、十（五行土数）。<br />在人体为鼻、背、手指、关节、左腿（九宫位）、脚趾、乳房、脾、胃、结肠。<br />在动物为狗、为虎、鼠、狼、熊、牛等有牙、有角的动物，还有昆虫、爬虫、家畜等有尾的动物。<br />在静物为岩石、山坡、土堆、坟墓、墙壁、门坎、阶梯、台阶、门板、石碑、土炕、柜台、桌子、床。颜色为黄色、棕黄、咖啡色、或白色（八白）。五味为甘，甜味。<br />"},
{gua:"兑",title:"兑",note:"兑为泽，为雨，表示喜悦和言词。天象为潮湿天气，气压低、露水、阴雨连绵。<br />在家庭为少女、小女孩；在社会为与嘴有关的职业，如讲师、教授、演说家、讲解员、翻译、巫师、占卜者、媒婆、传达室人员、歌唱家、音乐家、相声演员、娱乐场所人员、娼妓、牙科蓬生、外科医生等。<br />在场所为沼泽地、峡谷、洼地、湖泊、池塘、滑冰场、游乐园、会议室、音乐厅、茶座、饭店、废墟、旧屋、山口、洞穴、井。<br />在方位为西方，东南（先天八卦方位）。<br />在时间为农历八月，酉年、月、日、时，秋分到霜降45天。<br />在数字为二（先天八卦数）、七（九宫数）、四、九（五行金数）。<br />在人体为口、舌、牙齿、咽喉、肺、右肋（九宫位）、肛门等。<br />在动物为羊、豹、豺、猿猴、水鸟、兔子、沼泽动物、鸡鸭。<br />静物为石榴、胡桃、饮食用具、带口的器物、刀剑、剪刀、玩具、破损物品、垃圾箱等。<br />颜色为白色，或赤色（七赤）<br />五味为辛、辣<br />"},
{tgan:"甲",title:"甲",note:"五行属阳木，位居东方。五脏受病主胆，在人体表主头部。五味主酸，颜色主青色。其质劲健性直，体形长方，有萌动作用。得令为栋梁，失令为废材；受克太过则无用，生旺太过则漂泊无依。性格过于自负，不能娴于世故。在奇门中为首领，为主帅，经常遁在六仪之下"},
{tgan:"乙",title:"乙",note:"五行属阴木，位居东方。五脏受病主肝，体表主脖项和肩。颜色主碧或浅绿色。五味主酸甘。体质柔嫩。得令则繁华茂盛，失令则桔萎。性格柔顺，依附世情。在奇门中为日奇，为医生，为女人，为妻"},
{tgan:"丙",title:"丙",note:"五行属阳火，位居南方。五脏受病主小肠，体表主肩或额。颜色主紫赤色，五味苦辣。性格刚烈，工作清廉。得令得时则战果辉煌，失令则灰槁无力。能成大材，但难持久。在奇门中为月奇，为有权威之人，为婚姻的第三者男人"},
{tgan:"丁",title:"丁",note:"五行属阴火，位居南方。五脏受病主心脏，体表主胸和舌。颜色淡红，五味属苦。形体秀丽清高。性格和顺而有心计。得令是销熔暴戾，洞察奸邪；失令则愁苦、呻吟。在奇门中为星奇，为玉女，婚姻中的第三者女人"},
{tgan:"戊",title:"戊",note:"五行属阳土，位居中方。五脏受病主胃，体表主肋和鼻子。颜色深黄，五味甘辛。性格刚烈暴躁，体形敦厚。得令则豪杰果敢，失令则愚笨痴呆。在奇门中又为天门，又代资本、钱财等"},
{tgan:"己",title:"己",note:"五行属阴土，位居中央。五脏受病主脾，体表主腹部和面部。颜色浅黄，五味甘辛。性格温顺，体质沉静。得令则教化万物，失令则洁身自好。在奇门中又为地户，代一坟墓等"},
{tgan:"庚",title:"庚",note:"五行属阳金，位居西方。五脏受病主大肠，体表主脐轮和筋。颜色主白，五味辛辣。体形长方。性格刚健锐利，得令呈其专制，失令则失去雄威。其性坚执能屈人，而不屈于人。在奇门中又代表贼人、丈夫、仇人、公安干警等"},
{tgan:"辛",title:"辛",note:"五行属阴金，位居西方。五脏受病主肺，体表主胸部和股部。颜色浅白，五味苦辣。体形方正沉静。性格忠诚爽柔，其为用坚耐似玉，得令则黄钟，失令则瓦缶。在奇门中往往代表罪人或犯过错误的人"},
{tgan:"壬",title:"壬",note:"五行属阳水，位居北方。五脏受病主膀胱、三焦，体表则主小腿。颜色深黑，五味主咸。性格柔而险，可共忧患，难以同乐。得令则济物利人，失令则妨贤害国。在奇门中又代表与流动有关的事物"},
{tgan:"癸",title:"癸",note:"五行属阴水，位居北方。五脏受病主肾和心包，体表则主足。颜色浅黑，五味咸浊。性可知阴柔浅露，得令则从龙变化，狐假虎威；失令则沉溺灰心，或摇尾乞怜。在奇门中往往代表与女性、与性生活有关系的事物或人"},
{dgan:"甲",title:"甲",note:"五行属阳木，位居东方。五脏受病主胆，在人体表主头部。五味主酸，颜色主青色。其质劲健性直，体形长方，有萌动作用。得令为栋梁，失令为废材；受克太过则无用，生旺太过则漂泊无依。性格过于自负，不能娴于世故。在奇门中为首领，为主帅，经常遁在六仪之下"},
{dgan:"乙",title:"乙",note:"五行属阴木，位居东方。五脏受病主肝，体表主脖项和肩。颜色主碧或浅绿色。五味主酸甘。体质柔嫩。得令则繁华茂盛，失令则桔萎。性格柔顺，依附世情。在奇门中为日奇，为医生，为女人，为妻"},
{dgan:"丙",title:"丙",note:"五行属阳火，位居南方。五脏受病主小肠，体表主肩或额。颜色主紫赤色，五味苦辣。性格刚烈，工作清廉。得令得时则战果辉煌，失令则灰槁无力。能成大材，但难持久。在奇门中为月奇，为有权威之人，为婚姻的第三者男人"},
{dgan:"丁",title:"丁",note:"五行属阴火，位居南方。五脏受病主心脏，体表主胸和舌。颜色淡红，五味属苦。形体秀丽清高。性格和顺而有心计。得令是销熔暴戾，洞察奸邪；失令则愁苦、呻吟。在奇门中为星奇，为玉女，婚姻中的第三者女人"},
{dgan:"戊",title:"戊",note:"五行属阳土，位居中方。五脏受病主胃，体表主肋和鼻子。颜色深黄，五味甘辛。性格刚烈暴躁，体形敦厚。得令则豪杰果敢，失令则愚笨痴呆。在奇门中又为天门，又代资本、钱财等"},
{dgan:"己",title:"己",note:"五行属阴土，位居中央。五脏受病主脾，体表主腹部和面部。颜色浅黄，五味甘辛。性格温顺，体质沉静。得令则教化万物，失令则洁身自好。在奇门中又为地户，代一坟墓等"},
{dgan:"庚",title:"庚",note:"五行属阳金，位居西方。五脏受病主大肠，体表主脐轮和筋。颜色主白，五味辛辣。体形长方。性格刚健锐利，得令呈其专制，失令则失去雄威。其性坚执能屈人，而不屈于人。在奇门中又代表贼人、丈夫、仇人、公安干警等"},
{dgan:"辛",title:"辛",note:"五行属阴金，位居西方。五脏受病主肺，体表主胸部和股部。颜色浅白，五味苦辣。体形方正沉静。性格忠诚爽柔，其为用坚耐似玉，得令则黄钟，失令则瓦缶。在奇门中往往代表罪人或犯过错误的人"},
{dgan:"壬",title:"壬",note:"五行属阳水，位居北方。五脏受病主膀胱、三焦，体表则主小腿。颜色深黑，五味主咸。性格柔而险，可共忧患，难以同乐。得令则济物利人，失令则妨贤害国。在奇门中又代表与流动有关的事物"},
{dgan:"癸",title:"癸",note:"五行属阴水，位居北方。五脏受病主肾和心包，体表则主足。颜色浅黑，五味咸浊。性可知阴柔浅露，得令则从龙变化，狐假虎威；失令则沉溺灰心，或摇尾乞怜。在奇门中往往代表与女性、与性生活有关系的事物或人"},
{shen:"符",title:"值符",note:"它具有戊、己中央土的性质，是八神的领袖，所到之处，百恶消散，即使太白庚金这最凶的恶煞，临于值符之下，也便消形入墓，不能作恶了。故古人又称它为天乙之神"},
{shen:"蛇",title:"腾蛇",note:"具有南方火的性质，为虚诈之神。性格虚伪，口舌毒辣，专管惊恐怪异、虚诈不实之事"},
{shen:"阴",title:"太阴",note:"具有西方阴金性质，为荫护之神。它性格阴匿暗味。太阴所临之方，可以密谋策划、避难藏兵"},
{shen:"合",title:"六合",note:"具有东方木的性质，为护卫之神。它性格开朗平和，专管婚姻交易中介之事。六合所临之方，利于谈判，交易、婚姻嫁娶"},
{shen:"虎",title:"白虎",note:"具有西方金的性质，为凶煞神。它的性格凶猛好斗，专管行兵打仗、凶杀打斗、疾病死伤、交通事故等。白虎下隐有勾陈，勾陈具有地户己土性质，己土长生于酉，故隐于白虎之下"},
{shen:"武",title:"玄武",note:"具有北方水的性质，为奸谗小盗之神。性格爱偷（包括偷情）喜盗，专管盗贼、逃亡、口舌之事。朱雀本来是南方火神，但北方玄武子水之位，正是丙火怀胎之地，所以朱雀隐于玄武之下，也管一些口舌是非之事"},
{shen:"地",title:"九地",note:"具有坤土的性质，有厚载之德，为万物之母。古人称期为坚牢这神，性格柔顺安静，滋生万物。九地之方，利于屯兵固守，播种养殖"},
{shen:"天",title:"九天",note:"具有乾金的性质，为天为父。古人称期为威悍之神，性格刚强好动。九天之方可以扬兵布阵，行军打仗，坐飞机旅游出国"},
{star:"蓬",title:"天蓬星",note:"原名贪狼星，与北方一宫坎卦相对应，阳星，五行属水。坎水正当隆冬季节，至寒至冷至暗，喜阴害阳，人们认为它和盗贼出没有关，所以把它称为凶星、盗星。宜安抚边境，修筑城池，兴作土木，培垫堤防，屯兵固守；余事不利，特别是经商出行易遇盗贼或破财、生病"},
{star:"芮",title:"天芮星",note:"原名巨门星，与西南方二宫坤卦相对应，阴星，五行属土。因与八门中死门相对应，认为它的出没与疾病流行有关，所以把它称为病星、凶星，奇门预测疾病一般以它为用神，看它落在何宫及其旺相休囚，来定病的部位及轻重愈后状况。适宜受业师长、交纳朋友、屯兵固守，不宜用兵、嫁娶、争讼、迁徙、修造等。"},
{star:"冲",title:"天冲星",note:"原名禄存星，与东方三宫震卦相对应，阳星，五行属木。人们认为它有慈心造化，助人为乐之德，与农事活动有关，故把它称为吉星，但吉利程度不如天心、天任、天辅三星，所以有人叫它次吉之星。宜于选将出师，征代交战，鸣金击鼓，摇旗呐喊。其它一般或不利"},
{star:"辅",title:"天辅星",note:"原名文曲星，与东南四宫巽卦相对应，阳星，五行属木。人们认为它是天上的文曲星，与文化教育事业有关，故称为大吉之星。天辅星临宫百事皆宜，出行、经商、婚娶、修造均吉，特别利于升学考官，发展文化教育事业"},
{star:"禽",title:"天禽星",note:"原名廉贞星，与中央五宫相对应，阳星，五行属土。土生万物，中宫是遁甲元帅值符所在之地，故为大吉之星。天禽星临宫，百事皆宜，四时皆吉"},
{star:"心",title:"天心星",note:"原名武曲星，与四宫天辅星文曲星相对，处西北六宫干位，阴星，五行属金。人们认为它能动能静，与干卦为天为父为首长相应，长天心计，和领导才能、军事指挥、医疗治病有关，故称为大吉之星。它是天上的武曲星，既能惩恶助善，百事吉昌，又利求仙长寿，治病配药"},
{star:"柱",title:"天柱星",note:"原名破军星，与西方七宫兑卦相对应，阴星，五行属金。人们认为它正当金秋肃杀之时，喜杀好战，与惊恐怪异、破坏毁折有关，故名为凶星。宜于修筑营垒，训练士卒，屯兵固守，不宜出战交兵、经商远行，强行则车破马伤、士卒败亡、破财折本、意外伤灾。"},
{star:"任",title:"天任星",note:"原名左辅星，与东北八宫艮卦相对应，阳星，五行属土。人们认为土能生万物，又正当春季万物萌生之时，故称之为吉星。宜立国邑，安人民，断决群凶，教化人民，入官见贵，商贾嫁娶，百事皆吉，四时皆宜"},
{star:"英",title:"天英星",note:"原名右弼星，与同方九宫离卦相对应，阴星，五行属火。人们认为天英星居离宫之位，烈火炎炎，性躁易暴，虽然如日升中天，在放光明，但又和血光之灾有关，故称为中平之星，或小凶之星。宜于谋划献策，面君谒贵，不宜求财考官，嫁娶迁徙"},
{men:"开",title:"开门",note:"开门居西北干宫，五行属金。干卦是八卦之首，为天为父，于社会之首长；干纳甲壬，干位有亥，亥为甲木长生之地，甲又为十干之首，所以古人对应干宫的门命名为开门，喻万物开始之意，为大吉大利之门。考诸中国历史，几乎所有开国之君俱从西北干位开创基业，开门之名不虚也。<br />开门属金，旺于秋季，特别是戌、亥月，相于四季末，休于冬，囚于春，死于夏。开门居干宫伏吟，居巽宫反吟，居艮宫入墓，居离宫受制，居坤宫大吉，居兑宫旺相，居坎宫次吉，居震宫为迫。开门大吉，利于开业经商，征战远行，考学参军，婚取乔迁，建筑贸易，添人进口，治病求医"},
{men:"休",title:"休门",note:"休门居北方坎宫，属水。坎水得干金之生，于人为中男，上有兄下有弟，从容休闲；又坎宫处冬季最寒冷季节，万物休息冬眠，故古人命名为休门，乃休养生息之地。变为吉利之门。<br />休门属水，旺于冬季，特别是子月，相于秋，休于春，囚于夏，死于四季末月。休门居坎宫为伏吟，居离宫反吟，居巽宫入墓，居坤艮二宫受克，居干兑二宫大吉，居震宫次吉。  休门也为吉门，利于求见领导和贵人，上官赴任，嫁聚迁徙，经商建造，但不利行刑断狱"},
{men:"生",title:"生门",note:"生门属土，居东北方艮宫，正当立春之生，万物复苏，阳气回转，土生万物，所以古人命名为生门，大吉大利之门。<br />生门旺于四季月，特别是丑、寅之月，相于夏，休于秋，囚于冬，死于春，生门居艮宫伏吟，居坤宫反吟，居巽宫入墓，居震宫受克，居离宫大吉，居干兑二宫次吉，居坎宫被迫。  生门大吉，利于求财，特别是搞房地产、种植业、养殖业等。征战出行、嫁聚建造也为吉利。但不利埋葬治丧。"},
{men:"伤",title:"伤门",note:"伤门居东方震宫，五行属木，正当卯月春分之后甲木帝旺之时，旺则易折；震卦主动，动则易伤；元帅甲子常隐于戊土之下，子与卯相刑，刑则受伤，故古人将与震宫对应的八门命名为伤门。伤门属凶门，主人遭疾病刑伤之象。<br />伤门属木，旺于春，特别是卯月，相于冬，休于夏，囚于季月，死于秋。伤门居震宫伏吟，居兑宫反吟，居坤宫入墓，居坎宫生旺大凶，居干宫受制，居艮宫被迫大凶，居离宫泄气。  伤门为凶门，不利经商、出行、赴任、修造、嫁娶，经商易破财，出行易有灾。但适宜于索债、捕捉盗贼、渔猎、赌钱等。"},
{men:"杜",title:"杜门",note:"杜门居东南巽宫，属木。巽为长女，受干父之冲克，又克坤母，与父母皆不和，故在家中处事阻塞不利；又巽宫位有辰土，既是水墓、土墓又是辛金之墓；八卦九宫均为阴阳对立统一格局，西北方为开门，与它对冲的东南方自然就命名为杜门，一开一杜，二者对立统一，4+6=10，统一于五行地数（9为天数，先天八卦对冲方位二卦相加均为9数；后天八卦对冲方位二卦相加均为10数，10为地数）。<br />杜门属木，旺于春季，特别是辰、巳月，相于冬，休于夏，囚于四季月，死于秋。杜门居巽宫伏吟，居干宫反吟，居坤宫入墓，居兑宫受克，居艮宫被迫，居坎宫受生，居震宫比和，居离宫泄气。 杜门小凶，也为中平。在人事上多主武官、军队、警察、公安、安全等具有检察性质的单位。杜门为藏形之方，适宜于躲灾避难、捕盗剿贼、防洪筑堤、判决隐狱等，余事皆不利。"},
{men:"景",title:"景门",note:"景门居南方离宫，属火。在家中为中女，在干金为父，与丈夫中男坎水对冲，易动口舌，常有血光之灾；又景门正当日升中天、大放光明之时，但烈日炎炎，虽夏季景色美丽，但难免有酷暑之忧；又景门所在离宫正南与正北坎宫休门相对，一个万物闭藏休息，一个万物繁茂争长，故古人命名为景门。<br />景门属火，旺于夏，特别是午月，相于春，休于四季月，囚于秋，死于冬。居离宫伏吟，居坎宫反吟，居干宫入墓，居兑宫被迫，居震、巽二宫生旺，居坤、艮二宫生宫为休。  景门小吉，亦为中平。宜于献策筹谋，选士荐贤，拜职遣使，火攻杀戮，余者不利，谨防口舌及血光、火灾。景门多主文书之事。"},
{men:"死",title:"死门",note:"死门居西南坤宫，属土。死门与艮宫生门相对，万物春生秋死，春种秋收，故命名为死门。<br />死门属土，旺于秋季，特别是未、申月，相于夏，囚于冬，死于春。居坤宫伏吟，居艮宫反吟，居巽宫入墓，居震宫受克，居离宫生旺大凶，居坎宫被迫大凶，居干、兑二宫相生为休。 死门为凶门，不利吉事，只宜吊死送丧，刑戮争战，捕猎杀牲。"},
{men:"惊",title:"惊门",note:"惊门居西方兑位，属金。正当秋分、寒露、霜降之时，金秋寒气肃杀，草木面临凋蔽，一片惊恐萧瑟之象；又兑卦为泽，为缺，为破损；又兑主口，主口舌官非，故古人将此门命名为惊门，与东方震宫伤门相对应。<br />惊门属金，旺于秋，特别酉月，相于四季月，休于冬，囚于春，死于夏。居兑宫伏吟，居震宫反吟，居艮宫入墓，居离官受制，居巽宫为迫，居坎宫泄气，居坤宫受生，居干宫比和。 惊门也是一凶门，主惊恐、创伤、官非之事。适宜斗讼官司、掩捕盗贼、蛊惑乱众、财博游戏，其余事不可为。"},
]
var qimen={
    dgan:"",
    tgan:"",
    sizhu:"",
    gua:t.baguabyG,   
    star:"",
    men:"",
    shen:"",
    dx:null,
    ju:null,
    box:null,
    boxres:null,
    boxhead:null,
    skon:[0,0,0,0,0,0,0,0,0,0],
}
function jieqivalue(yr,no){
    //从0开始，第一个节气是小寒
    var val,basedx;
    basedx=Date.parse("2016/01/06 06:08:21")+t.termyearlen*24*60*60*1000*(yr-2016);
    val=new Date();
    val.setTime(basedx+t.terminfo[no]*1000);
    return val;
}
function jieqi(dx){
    var y,m,d,d1,d2,r,r2,y2;
    y=dx.getFullYear();
    m=dx.getMonth();
    d=dx.getDate();
    d1=jieqivalue(y,m*2);
    d2=jieqivalue(y,m*2+1);
    if (dx<d1) 
        r=m*2-1
    else if(dx<d2)
        r=m*2
    else
        r=m*2+1
    if (r<0) {r=r+24;y=y-1;}
    r2=(r+1)%24;
    y2=y;
    if (r+1>23){y2=y2+1;}
    past=(dx-jieqivalue(y,r))/1000/3600/24;
    past=past.toFixed(2);
    percentage=(dx-jieqivalue(y,r))/(jieqivalue(y2,r2)-jieqivalue(y,r));
    return {"name":t.jieqibyyear[r],"past":past,"percentage":percentage};
}
function nianzhu(dx){
    var y,a,b,c;
    y=dx.getFullYear();
    a=y%10;
    a=a-3;
    if (a<=0) a=a+10;
    b=y%100;
    if (y>=1800 && y<=1899) 
        b=b+9
    else if (y<=1999)
        b=b+1
    else if (y<=2099)
        b=b+5
    b=b%12;
    if (b==0) b=12;
    return t.gan[a-1] + t.zhi[b-1];
}
function yuezhu(dx){
    var xs,a,b,c;
    xs=Array(2,4,6,8,0);
    b=Math.floor(t.jieqibyyear.indexOf(jieqi(dx).name)/2);
    c=t.gan.indexOf(nianzhu(dx).substr(0,1));
    a=xs[c%5]+b-1;
    a=(a+10)%10;
    return t.gan[a] + t.zhibyjieqi[b];
}
function rizhu(dx){
    var y,m,d,s,s2,r,u,x;
    var a,b;
    y=dx.getFullYear();
    s=Number(String(y).substr(-2))-1;
    s2=Math.floor(s/4);
    u=s%4;
    m=Number(Array(0,31,-1,30,0,31,1,32,3,33,4,34)[dx.getMonth()+1-1]);
    d=dx.getDate();
    x=Number(Array(3,47,31,15,0,44,28,12,57,41)[Math.floor((y-1)/100-16)]);
    r=s2*6+5*(s2*3+u)+m+d+x;
    if (((y%4==0 && y%100!=0) || (y%400==0)) && (dx.getMonth()+1>2)) r=r+1;
    //这里还有个当天23点之后也是下一天
    if (dx.getHours()>22) r=r+1;
    r=r%60;
    a=r%10;
    b=r%12;
    if (a==0) a=10;
    if (b==0) b=12;
    return t.gan[a-1] + t.zhi[b-1];
}
function shizhu(dx){
    var z,g;
    z=Math.floor(((dx.getHours()+1) % 24)/2)+1;
    g=(t.gan.indexOf(rizhu(dx).substr(0,1))+1)*2+z-2;
    g=g%10;
    if (g<=0) g=g+10;
    //console.log(g); 
    return t.gan[g-1] + t.zhi[z-1];
}
function sanyuan(dx,style){
    var yuan,k;
    var gi,zi,gs,zs,zi2,g,z;
    var ab,xo;
    //console.log(style);
    //茅山起局
    if (style=="maoshan"){
        yuan=Math.floor(jieqi(dx).past/5);
    }
    //平均分法
    else if (style=="average"){
        //console.log(jieqi(dx).percentage);
        k=jieqi(dx).percentage;
        if (k<1/3) 
            yuan=0
        else if (k<2/3)
            yuan=1
        else
            yuan=2
    }
    //根据日干计算
    else if (style="classic"){
        gs=["子午卯酉","寅申巳亥","辰戌丑未"];
        ab=rizhu(dx);
        gi=t.gan.indexOf(ab[0]);
        zi=t.zhi.indexOf(ab[1]);
        xo=gi%5;
        zi2=zi-xo;
        if (zi2<0) zi2=zi2+12;
        z=t.zhi[zi2];
        for (var i=0;i<3;i++){
            if (gs[i].indexOf(z)>-1) {yuan=i;break;};
        }
        //console.log("yuan",yuan);
            
    }

    return yuan;
}
function yinyangju(dx){
    var k,a,b,c,d,yy;
    //获取节气对应的阴阳变化顺序，0~3阳，4~7阴
    k=t.jieqibyyinyang.indexOf(jieqi(dx).name);
    a=Math.floor(k/3);
    b=k%3;
    //console.log(a,b);
    yy=(a<4)?1:-1;
    //获得节气对应八卦在九宫中的序号
    k=t.baguabyG.indexOf(t.baguabyyinyang[a]);
    //八卦中第一个节气上元局数为k+1
    c=k+1;
    //根据同一卦中节气的顺序变化
    c=b*yy+c;
    //上中下元
    c=c+sanyuan(dx,tconfig.yuanstyle)*6*yy;
    //归一化
    c=yy*((c+9*9)%9);
    if (c==0) c=yy*9;
    //console.log("c",c);
    return (c);
}

function swsRel(sg,sz){
    var a,b,tk,sz2,ox;
    ox="";
    for (var i=0;i<sz.length;i++){
        sz2=sz[i];
        a=t.zhi.indexOf(sz2);
        b=t.zhi.indexOf(t.zhibyS[t.gan.indexOf(sg)]);
        tk=a-b;
        if(t.gan.indexOf(sg)%2!=0) tk=-tk;
        if(tk<0) tk=tk+12;//
        ox=ox+t.sws[tk]+"/";
    }
    return ox.substr(0,ox.length-1);
}


//判断是否匹配某个格局
function boxIs(boxid,ruleid){
    var k,vk,v1,v11,v2,k1,k2;
    var sub,insub,insubsub;
    var zs="年月日时",ks="干支";
    for (var key in rules[ruleid]){
        if (key=="tgan" || key=="dgan"){
            k="liusan"
            for (var i=0;i<zs.length;i++){
                //替换年月日时->对应的六三
                for (var j=0;j<ks.length;j++){
                    rules[ruleid][key]=rules[ruleid][key].replace(new RegExp(zs[i]+ks[j], 'g'),qimen.sizhu.substr(i*2+j,1));                                
                }
                
            }
        }
        else if (key=="shen") k="shenbyB"
        else if (key=="star") {
            k="xingbyG";
            rules[ruleid][key]=rules[ruleid][key].replace(new RegExp("符", 'g'),t.xingbyB[qimen.xid] );
            }
        else if (key=="men") {
            k="menbyB";
            rules[ruleid][key]=rules[ruleid][key].replace(new RegExp("使", 'g'),t.menbyB[qimen.xid] );            
            }
        else if (key=="gua") k="baguabyG"
        else if(key=="title" || key=="note") continue 
        v1=rules[ruleid][key].split("/"); 
        //sub：初始为错，如果有一次insub正，就无视以后，最终得到sub
        insub=false;
        for (vk in v1){
            v11=v1[vk];
            //子条件中，一个吻和就继续true
            if (insub) continue;
            //当前时间，都是并列
            if (key=="sizhu"){
                //subsub：初始为正，如果有一次错，就无视以后的计算，最终得到的insub是subsub
                insubsub=true;
                for (var i=0;i<v11.length/3;i++) {
                    if (insubsub==false) continue;
                    k1=v11.substr(i*3+2,1);
                    insubsub= (qimen[key].substr(zs.indexOf(v11.substr(i*3,1))*2+ks.indexOf(v11.substr(i*3+1,1)),1)==k1);
                }
                insub=insubsub;
            }
            else{
                
                v2=qimen[key][boxid];
                //insub= (t[k].indexOf(v11)==v2);
                //console.log("k",k);
                //insub= (v11==qimen[key][v2]);
                insub= (t[k].indexOf(v11)==v2);
                if (rules[ruleid]["men"]=="生/死"){
                }
            }
        }
        sub=insub;
        //sub指每个条件，只要有一项不正确就返回错
        if (!sub) return false;
    }
    
    return true;
}

function xun(ab){
    var vidx=[0,-10,-8,-6,-4,-2];
    k=t.gan.indexOf(ab.substr(0,1))-t.zhi.indexOf(ab.substr(1,1));
    if (k>0) k=k-12;
    //console.log("k",k);
    k=vidx.indexOf(k);
    return k;
}

function shige(){
    //天显时格和五不遇时
    var ox="";
    var rg=qimen.sizhu.substr(4,1),ss=qimen.sizhu.substr(6,2);
    if ((rg=="甲" && ss=="庚午") || (rg=="乙" && ss=="辛巳") || (rg=="丙" && ss=="壬辰") || (rg=="丁" && ss=="癸卯") || (rg=="戊" && ss=="甲寅") || (rg=="己" && ss=="乙丑") || (rg=="庚" && ss=="丙子") || (rg=="辛" && ss=="丁酉") || (rg=="壬" && ss=="戊申") || (rg=="癸" && ss=="己未")) ox=ox+"<b>五不遇时</b><br />";
    if (((rg=="甲" || rg=="己") && (ss=="甲子" || ss=="甲戌")) || ((rg=="乙" || rg=="庚") && ss=="甲申") || ((rg=="丙" || rg=="辛") && ss=="甲午") || ((rg=="丁" || rg=="壬") && ss=="甲辰") || ((rg=="戊" || rg=="癸") && ss=="甲寅")) ox=ox+"<b>天显时格</b><br />";
    return ox;
    
}

function tellbox(boxid){
    var ox,rid,swstate,ox2,skon,skgo;
    if (boxid!=4){
        swstate=t.liusan[qimen.tgan[boxid]]+" "+swsRel(t.liusan[qimen.tgan[boxid]],t.zhibyG[boxid])+"<br />";
        swstate=swstate+t.liusan[qimen.dgan[boxid]]+" "+swsRel(t.liusan[qimen.dgan[boxid]],t.zhibyG[boxid])+"<br />";
        ox="<h2>"+t.baguabyG[boxid]+t.no[boxid+1]+"宫</h2>"+swstate;
        /*skon=t.xunkong[xun(qimen.sizhu.substr(6,2))];
        if (t.zhibyG.indexOf(skon[1])==boxid){ox=ox+"<li><b>时空</b></li>";} 
        else if (t.zhibyG.indexOf(skon[0])==boxid){ox="<li>时空</li>"+ox;} */
        for (var i=0;i<qimen.boxres[boxid].length;i++){
            rid=qimen.boxres[boxid][i];
            ox=ox+"<li><b>"+rules[rid].title+"</b><br />";
            ox2="(";
            for (var k in rules[rid]){
                if (k!="note" && k!="title") ox2=ox2+rules[rid][k]+"+";
            }
            ox2=ox2.substr(0,ox2.length-1)+")<br />"
            ox2=(ox2.indexOf("+")>-1)?ox2:"";
            ox=ox+ox2+rules[rid]["note"]+"</li>";
        }
    }
    else {
        ox="";
    }
    return ox;
}

//计算九宫内的元素
function initQimen(dx){
    var ju=yinyangju(dx);
    var dgan=(ju>0)?"012345678":"087654321";
    var seq=(ju>0)?"01234567":"07654321";
    var tgan,star,men,shen;
    var k,xunshou,xid,xpos,xposzero,mid,mpos,spos
    var osx,jux,c,temp,temp2,temp3,temp4,temp5,dbg,spos0;
    var tg1,tg2,tg3,tg4,tg5,tg6,tg7,tg8;
    dbg="";
    //计算布局：地盘干
    jux=Math.abs(ju)-1;
    dgan=dgan.substr(-jux) + dgan.substr(0,9-jux); //if (k!=0)
    //根据时柱，计算天盘旬首：戊己庚辛壬癸0~5
    var vidx=[0,-10,-8,-6,-4,-2];
    ab=shizhu(dx);
    k=t.gan.indexOf(ab.substr(0,1))-t.zhi.indexOf(ab.substr(1,1));
    if (k>0) k=k-12;
    //console.log("k",k);
    k=vidx.indexOf(k);
    xunshou=k;
    //xid：旬首宫位，也是星（值符）的id
    //mid：门（值使）的序号，首先根据xid确定宫对应的门，需要再转换成八个里面的顺序
    xid=dgan.indexOf(xunshou);
    mid=t.menbyB.indexOf(t.menbyG[xid]);
    //初始坐标xpos：星（值符）位置即时干所在宫
    //因为现在时间的天干有10种，宫只有9个，所以如果时干为甲，那么转换成旬首对应的六仪所在宫
    k=t.liusan.indexOf(ab.substr(0,1));
    k=(k<0)?xunshou:k;
    xpos=dgan.indexOf(k);
    xposzero=xpos;
    //初始坐标mpos：门（值使）位置，根据 时支 与 旬首地支的差值，从 旬首宫位 开始，顺推门盘宫位
    k=t.zhi.indexOf(ab.substr(1,1))-t.zhi.indexOf(t.xunshou[xunshou]);
    if (k<0) k=k+12;
    k=(ju>0)?(xid+k):(xid-k);
    k=(k+18)%9
    mpos=k;
    //xpos作为时干在地盘中的宫位，不可以在中间，涉及后面的转盘
    if (mpos==4) mpos=tconfig.zhonggong[(Math.abs(ju)+ju)/ju/2];
    if (xpos==4) xpos=tconfig.zhonggong[(Math.abs(ju)+ju)/ju/2];
    //初始坐标spos：八神位置
    spos=xpos;
    //计算布局：天盘干，根据地盘干，进行旋转 时干所在宫位-旬首对应地盘
    var tgax=[9,9,9,9,9,9,9,9,9,9];
    var starx=[9,9,9,9,9,9,9,9,9,9];
    var menx=[9,9,9,9,9,9,9,9,9,9];
    var shenx=[9,9,9,9,9,9,9,9,9,9];
    ////旬首的地盘宫位不可为中宫，与上面xpos涉及转动
    temp2=dgan.indexOf(xunshou);
    //console.log(temp2);
    if (temp2==4) temp2=tconfig.zhonggong[(Math.abs(ju)+ju)/ju/2];
    temp5=temp2;
    temp2=(t.ordplate.indexOf(xpos)-t.ordplate.indexOf(temp2)+8)%8;
    tg3=xid;
    if (tg3==4) tg3=tconfig.zhonggong[(Math.abs(ju)+ju)/ju/2];
    tg1=t.ordplate.indexOf(xpos)-t.ordplate.indexOf(tg3);
    tg1=(tg1+8)%8;
    for (var i=0;i<9;i++){
        temp4=dgan.indexOf(i);        //若地盘干位于中宫，将移动后的天盘干数据存储到tgax[9]，小数点分隔为六三、宫位
        //天盘干
        if (temp4==4) {
            temp4=tconfig.zhonggong[(Math.abs(ju)+ju)/ju/2];
            temp3=t.ordplate[(temp2+t.ordplate.indexOf(temp4)+8)%8];
            tgax[9]=i+temp3/10;
        }
        else{
            temp3=t.ordplate[(temp2+t.ordplate.indexOf(temp4)+8)%8];
            tgax[temp3]=i;
        }
        
        //星盘 中宫就是在xid做处理，这里没有记录额外信息
        //tg2=t.ordplate[(t.ordplate.indexOf(i)+tg1)%8];
        tg2=t.ordplate[(t.ordplate.indexOf(i)-tg1+8)%8];
        //console.log(i,"tg2",t.ordplate.indexOf(i),tg1,tg2);
        starx[i]=tg2;
        //门盘 都是顺时针
        tg4=(mid+t.ordplate.indexOf(i)-t.ordplate.indexOf(mpos)+8)%8;
        menx[i]=tg4;
        //神盘 阳顺阴逆
        tg5=seq[(t.ordplate.indexOf(i)-t.ordplate.indexOf(xpos)+8)%8];
        shenx[i]=tg5;
        
      }
    tgan=tgax.join("");
    star=starx.join("");
    men=menx.join("");
    shen=shenx.join("");
    //格局分析
    qimen.dgan=dgan;
    qimen.tgan=tgan;
    qimen.star=star;
    qimen.gua="012345678";
    qimen.men=men;
    qimen.shen=shen;
    qimen.sizhu=nianzhu(dx)+yuezhu(dx)+rizhu(dx)+shizhu(dx);
    qimen.xid=xid;
    qimen.dx=dx;
    qimen.ju=ju;
    var boxres=[[],[],[],[],[],[],[],[],[]];
    //for (var i=0;i<1;i++){
    for (var i=0;i<9;i++){
        for (var j=0;j<rules.length;j++){
            if (boxIs(i,j)) {
                //console.log(t.baguabyG[i]+"宫 - "+rules[j].title);
                boxres[i].push(j);
            }
        }
    }
    qimen.boxres=boxres;
    //打印布局
    //osx="<h1><a style='text-decoration:none;' href='#now'>"+tconfig.apptitle+"</a></h1>";
    osx="<h1>"+tconfig.apptitle+"</h1>";
    osx=osx+"<br />" + "时间&nbsp;&nbsp;"+qimen.dx.toLocaleString();
    osx=osx+"<br />" + "节气&nbsp;&nbsp;"+"阴阳"[(Math.abs(qimen.ju)+qimen.ju)/qimen.ju/2]+"遁&nbsp;&nbsp;" + t.no[Math.abs(qimen.ju)]+"局&nbsp;&nbsp;"+jieqi(qimen.dx).name+"&nbsp;&nbsp;"+"上中下"[sanyuan(qimen.dx,tconfig.yuanstyle)]+"元("+jieqi(qimen.dx).past+"天) ";
    osx=osx+"<br />" +"四柱&nbsp;&nbsp;"+qimen.sizhu.substr(0,2)+"&nbsp;&nbsp;"+qimen.sizhu.substr(2,2)+"&nbsp;&nbsp;"+qimen.sizhu.substr(4,2)+"&nbsp;&nbsp;"+qimen.sizhu.substr(6,2)+"&nbsp;&nbsp;";
    osx=osx+"<br />" +"旬空&nbsp;&nbsp;"+t.xunkong[xun(qimen.sizhu.substr(0,2))]+"&nbsp;&nbsp;"+t.xunkong[xun(qimen.sizhu.substr(2,2))]+"&nbsp;&nbsp;"+t.xunkong[xun(qimen.sizhu.substr(4,2))]+"&nbsp;&nbsp;"+t.xunkong[xun(qimen.sizhu.substr(6,2))]+"&nbsp;&nbsp;";
    qimen.boxhead=osx+shige();
    //时空
    var skon=t.xunkong[xun(qimen.sizhu.substr(6,2))];
    var k0=t.zhibyG.indexOf(skon[0]);
    var k1=t.zhibyG.indexOf(skon[1]);
    if (k0==-1 || k1==-1) {
        for (var i=0;i<9;i++) {
            if (t.zhibyG[i].indexOf(skon[0])>-1) k0=i
            if (t.zhibyG[i].indexOf(skon[1])>-1) k1=i
        }
    }
    qimen.skon[k0]=1;
    qimen.skon[k1]=1;
    //osx=osx+"<br /><br />"
    var boxes="........".split(".");
    for (var i=0;i<3;i++){
        for (var j=0;j<3;j++){
            //k为顺序数字
            k=j+i*3;tg6=k;
            //转换成宫格数字
            k=t.ordreal[k];
            if (k==4){
                
                temp4=tconfig.zhonggong[(Math.abs(ju)+ju)/ju/2];
                tg7=tconfig.zhonggong[(Math.abs(ju)+ju)/ju/2];
                tg8="\u3000寄\u3000";
                boxes[tg6]="\u3000"+t.liusan[tgan.substr(-3,1)] + tg8 + t.baguabyG[tgan.substr(-1,1)] + "<br /><br />" + "\u3000"+t.liusan[dgan[k]]+ tg8 +t.baguabyG[temp4] + "<br />" + "\u3000"+ t.xingbyG[k] + tg8 + t.baguabyG[star.indexOf(tg7)];
            }
            else{                
            //osx=osx + k + ".";
            /*
            显示格式：
            神   星   天盘干
            宫   门   地盘干
            */
            var xingstr=t.xingbyG[star[k]];
            var menstr=t.menbyB[men[k]];
            var shenstr=t.shenbyB[shen[k]];
            var skonstr=(qimen.skon[k]==0)?"\u3000":"&#9851";
            if (tg3==star[k]) xingstr="<span style='font-weight:bold;color:gold'>" + xingstr + "</span>";
            if (mpos==k) menstr="<span style='font-weight:bold;color:gold'>" + menstr + "</span>";
            if (xpos==k) shenstr="<span style='font-weight:bold;color:gold'>" + shenstr + "</span>";
            boxes[tg6]="\u3000"+shenstr + "\u3000" + xingstr + "\u3000" + t.liusan[tgan[k]] + "<br /><br />" +skonstr+ t.baguabyG[k] +"\u3000" + menstr  + "\u3000" + t.liusan[dgan[k]] + "<br /><br />";
            }
        }
    }
    qimen.box=boxes;

    /*
    dbg=dbg+"地盘干 -> "+dgan;
    dbg=dbg+"</li><li>"+ "旬首["+xunshou+"](+1) -> [甲"+t.xunshou[xunshou]+t.liusan[xunshou]+"] -> ["+t.liusan[xunshou]+"]在["+dgan.indexOf(xunshou)+"](+1)宫 -> ["+t.baguabyG[dgan.indexOf(xunshou)]+"]宫 -> xid:["+xid+"] -> 对应["+t.xingbyG[xid]+"]星(值符);["+t.menbyG[xid]+"]门(值使)";
    dbg=dbg+"</li><li>"+ "时干为["+ab.substr(0,1)+"] -> 在地盘中寻找 -> 位于["+t.baguabyG[xpos]+"]宫 -> ["+t.baguabyG[xpos]+"]宫即为["+t.xingbyG[xid]+"]星的位置";
    temp2=(t.zhi.indexOf(ab.substr(1,1))-t.zhi.indexOf(t.xunshou[xunshou])+12)%12;
    dbg=dbg+"</li><li>"+ "旬首地支为甲["+t.xunshou[xunshou]+ "]的["+t.xunshou[xunshou]+ "] -> 往后推["+temp2+"]个元素 -> " + "为["+ab.substr(1,1)+"]的时支 -> ["+"阴阳"[(Math.abs(ju)+ju)/ju/2]+"]遁就["+"逆顺"[(Math.abs(ju)+ju)/ju/2]+"]着值符位置["+t.baguabyG[xpos]+"]宫推["+temp2+"]个元素 -> ["+t.baguabyG[mpos]+"]宫即为["+t.menbyG[xid]+"]门(值使)位置";
    temp2=(t.ordplate.indexOf(xpos)-t.ordplate.indexOf(temp5)+8)%8;
    dbg=dbg+"</li><li>"+ "将旬首["+t.liusan[xunshou]+ "]放在时干["+ab.substr(0,1)+ "]的地盘宫位["+t.baguabyG[xpos]+"] -> 地盘的["+t.liusan[xunshou]+"]位于["+t.baguabyG[temp5]+"]宫("+dgan.indexOf(xunshou)+") -> 后者顺时针推["+temp2+"]个元素到达前者位置";
    dbg=dbg+"</li><li>";
    dbg=dbg+"<br />干 天盘对应宫格 地盘对应宫格<br />";
    for (var i=0;i<15;i++){dbg=dbg+">>"+t.baguabyG[t.ordplate[i%8]];}
    for (var i=0;i<9;i++){
        temp4=dgan.indexOf(i);
        if (temp4==4) temp4=tconfig.zhonggong[(Math.abs(ju)+ju)/ju/2];
        temp3=t.ordplate[(temp2+t.ordplate.indexOf(temp4)+8)%8];
        dbg=dbg+"<br />"+t.liusan[i]+"("+i+") -> "+t.baguabyG[dgan.indexOf(i)]+"("+dgan.indexOf(i)+") -> "+t.baguabyG[temp3]+"("+temp3+") -> "+(dgan.indexOf(i)-xid);
    }
    dbg=dbg+"</li><li>"+ t.xingbyG[xid]+ "(" + t.baguabyG[xpos] + ") " + t.menbyB[mid] + "(" + t.baguabyG[mpos] + ")" + t.ordplate
    dbg=dbg+"</li>"
    */
    osx=osx + dbg;
    return osx;
}
